; domain
(define (domain sokoban-sequential)
  (:requirements :typing)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?np ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?np)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?np ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?np))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?np)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?np ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?np)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?np ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?np))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?np)
                      (at-goal ?s)
                      )
   )

(:action wait
 :parameters ()
 :precondition (and)
 :effect (and)
)
)

; problem
(define (problem p146-microban-sequential)
  (:domain sokoban-sequential)
  (:objects
    dir-down - direction
    dir-left - direction
    dir-right - direction
    dir-up - direction
    player-01 - player
    pos-1-1 - location
    pos-1-2 - location
    pos-1-3 - location
    pos-1-4 - location
    pos-1-5 - location
    pos-1-6 - location
    pos-1-7 - location
    pos-1-8 - location
    pos-1-9 - location
    pos-2-1 - location
    pos-2-2 - location
    pos-2-3 - location
    pos-2-4 - location
    pos-2-5 - location
    pos-2-6 - location
    pos-2-7 - location
    pos-2-8 - location
    pos-2-9 - location
    pos-3-1 - location
    pos-3-2 - location
    pos-3-3 - location
    pos-3-4 - location
    pos-3-5 - location
    pos-3-6 - location
    pos-3-7 - location
    pos-3-8 - location
    pos-3-9 - location
    pos-4-1 - location
    pos-4-2 - location
    pos-4-3 - location
    pos-4-4 - location
    pos-4-5 - location
    pos-4-6 - location
    pos-4-7 - location
    pos-4-8 - location
    pos-4-9 - location
    pos-5-1 - location
    pos-5-2 - location
    pos-5-3 - location
    pos-5-4 - location
    pos-5-5 - location
    pos-5-6 - location
    pos-5-7 - location
    pos-5-8 - location
    pos-5-9 - location
    pos-6-1 - location
    pos-6-2 - location
    pos-6-3 - location
    pos-6-4 - location
    pos-6-5 - location
    pos-6-6 - location
    pos-6-7 - location
    pos-6-8 - location
    pos-6-9 - location
    pos-7-1 - location
    pos-7-2 - location
    pos-7-3 - location
    pos-7-4 - location
    pos-7-5 - location
    pos-7-6 - location
    pos-7-7 - location
    pos-7-8 - location
    pos-7-9 - location
    pos-8-1 - location
    pos-8-2 - location
    pos-8-3 - location
    pos-8-4 - location
    pos-8-5 - location
    pos-8-6 - location
    pos-8-7 - location
    pos-8-8 - location
    pos-8-9 - location
    pos-9-1 - location
    pos-9-2 - location
    pos-9-3 - location
    pos-9-4 - location
    pos-9-5 - location
    pos-9-6 - location
    pos-9-7 - location
    pos-9-8 - location
    pos-9-9 - location
    stone-01 - stone
    stone-02 - stone
  )
  (:init
    (IS-GOAL pos-4-2)
    (IS-GOAL pos-6-8)
    (IS-GOAL pos-7-8)
    (IS-GOAL pos-2-8)
    (IS-GOAL pos-2-7)
    (IS-GOAL pos-4-3)
    (IS-NONGOAL pos-1-1)
    (IS-NONGOAL pos-1-2)
    (IS-NONGOAL pos-1-3)
    (IS-NONGOAL pos-1-4)
    (IS-NONGOAL pos-1-5)
    (IS-NONGOAL pos-1-6)
    (IS-NONGOAL pos-1-7)
    (IS-NONGOAL pos-1-8)
    (IS-NONGOAL pos-1-9)
    (IS-NONGOAL pos-2-1)
    (IS-NONGOAL pos-2-2)
    (IS-NONGOAL pos-2-3)
    (IS-NONGOAL pos-2-4)
    (IS-NONGOAL pos-2-5)
    (IS-NONGOAL pos-2-6)
    (IS-NONGOAL pos-2-9)
    (IS-NONGOAL pos-3-1)
    (IS-NONGOAL pos-3-2)
    (IS-NONGOAL pos-3-3)
    (IS-NONGOAL pos-3-4)
    (IS-NONGOAL pos-3-5)
    (IS-NONGOAL pos-3-6)
    (IS-NONGOAL pos-3-7)
    (IS-NONGOAL pos-3-8)
    (IS-NONGOAL pos-3-9)
    (IS-NONGOAL pos-4-1)
    (IS-NONGOAL pos-4-4)
    (IS-NONGOAL pos-4-5)
    (IS-NONGOAL pos-4-6)
    (IS-NONGOAL pos-4-7)
    (IS-NONGOAL pos-4-8)
    (IS-NONGOAL pos-4-9)
    (IS-NONGOAL pos-5-1)
    (IS-NONGOAL pos-5-2)
    (IS-NONGOAL pos-5-3)
    (IS-NONGOAL pos-5-4)
    (IS-NONGOAL pos-5-5)
    (IS-NONGOAL pos-5-6)
    (IS-NONGOAL pos-5-7)
    (IS-NONGOAL pos-5-8)
    (IS-NONGOAL pos-5-9)
    (IS-NONGOAL pos-6-1)
    (IS-NONGOAL pos-6-2)
    (IS-NONGOAL pos-6-3)
    (IS-NONGOAL pos-6-4)
    (IS-NONGOAL pos-6-5)
    (IS-NONGOAL pos-6-6)
    (IS-NONGOAL pos-6-7)
    (IS-NONGOAL pos-6-9)
    (IS-NONGOAL pos-7-1)
    (IS-NONGOAL pos-7-2)
    (IS-NONGOAL pos-7-3)
    (IS-NONGOAL pos-7-4)
    (IS-NONGOAL pos-7-5)
    (IS-NONGOAL pos-7-6)
    (IS-NONGOAL pos-7-7)
    (IS-NONGOAL pos-7-9)
    (IS-NONGOAL pos-8-1)
    (IS-NONGOAL pos-8-2)
    (IS-NONGOAL pos-8-3)
    (IS-NONGOAL pos-8-4)
    (IS-NONGOAL pos-8-5)
    (IS-NONGOAL pos-8-6)
    (IS-NONGOAL pos-8-7)
    (IS-NONGOAL pos-8-8)
    (IS-NONGOAL pos-8-9)
    (IS-NONGOAL pos-9-1)
    (IS-NONGOAL pos-9-2)
    (IS-NONGOAL pos-9-3)
    (IS-NONGOAL pos-9-4)
    (IS-NONGOAL pos-9-5)
    (IS-NONGOAL pos-9-6)
    (IS-NONGOAL pos-9-7)
    (IS-NONGOAL pos-9-8)
    (IS-NONGOAL pos-9-9)
    (MOVE-DIR pos-1-1 pos-2-1 dir-down)
    (MOVE-DIR pos-1-1 pos-1-2 dir-right)
    (MOVE-DIR pos-1-2 pos-2-2 dir-down)
    (MOVE-DIR pos-1-2 pos-1-1 dir-left)
    (MOVE-DIR pos-1-2 pos-1-3 dir-right)
    (MOVE-DIR pos-1-3 pos-2-3 dir-down)
    (MOVE-DIR pos-1-3 pos-1-2 dir-left)
    (MOVE-DIR pos-1-3 pos-1-4 dir-right)
    (MOVE-DIR pos-1-4 pos-2-4 dir-down)
    (MOVE-DIR pos-1-4 pos-1-3 dir-left)
    (MOVE-DIR pos-1-4 pos-1-5 dir-right)
    (MOVE-DIR pos-1-5 pos-2-5 dir-down)
    (MOVE-DIR pos-1-5 pos-1-4 dir-left)
    (MOVE-DIR pos-1-5 pos-1-6 dir-right)
    (MOVE-DIR pos-1-6 pos-2-6 dir-down)
    (MOVE-DIR pos-1-6 pos-1-5 dir-left)
    (MOVE-DIR pos-1-6 pos-1-7 dir-right)
    (MOVE-DIR pos-1-7 pos-2-7 dir-down)
    (MOVE-DIR pos-1-7 pos-1-6 dir-left)
    (MOVE-DIR pos-1-7 pos-1-8 dir-right)
    (MOVE-DIR pos-1-8 pos-2-8 dir-down)
    (MOVE-DIR pos-1-8 pos-1-7 dir-left)
    (MOVE-DIR pos-1-8 pos-1-9 dir-right)
    (MOVE-DIR pos-1-9 pos-2-9 dir-down)
    (MOVE-DIR pos-1-9 pos-1-8 dir-left)
    (MOVE-DIR pos-2-1 pos-1-1 dir-up)
    (MOVE-DIR pos-2-1 pos-3-1 dir-down)
    (MOVE-DIR pos-2-1 pos-2-2 dir-right)
    (MOVE-DIR pos-2-2 pos-1-2 dir-up)
    (MOVE-DIR pos-2-2 pos-3-2 dir-down)
    (MOVE-DIR pos-2-2 pos-2-1 dir-left)
    (MOVE-DIR pos-2-2 pos-2-3 dir-right)
    (MOVE-DIR pos-2-3 pos-1-3 dir-up)
    (MOVE-DIR pos-2-3 pos-3-3 dir-down)
    (MOVE-DIR pos-2-3 pos-2-2 dir-left)
    (MOVE-DIR pos-2-3 pos-2-4 dir-right)
    (MOVE-DIR pos-2-4 pos-1-4 dir-up)
    (MOVE-DIR pos-2-4 pos-3-4 dir-down)
    (MOVE-DIR pos-2-4 pos-2-3 dir-left)
    (MOVE-DIR pos-2-4 pos-2-5 dir-right)
    (MOVE-DIR pos-2-5 pos-1-5 dir-up)
    (MOVE-DIR pos-2-5 pos-3-5 dir-down)
    (MOVE-DIR pos-2-5 pos-2-4 dir-left)
    (MOVE-DIR pos-2-5 pos-2-6 dir-right)
    (MOVE-DIR pos-2-6 pos-1-6 dir-up)
    (MOVE-DIR pos-2-6 pos-3-6 dir-down)
    (MOVE-DIR pos-2-6 pos-2-5 dir-left)
    (MOVE-DIR pos-2-6 pos-2-7 dir-right)
    (MOVE-DIR pos-2-7 pos-1-7 dir-up)
    (MOVE-DIR pos-2-7 pos-3-7 dir-down)
    (MOVE-DIR pos-2-7 pos-2-6 dir-left)
    (MOVE-DIR pos-2-7 pos-2-8 dir-right)
    (MOVE-DIR pos-2-8 pos-1-8 dir-up)
    (MOVE-DIR pos-2-8 pos-3-8 dir-down)
    (MOVE-DIR pos-2-8 pos-2-7 dir-left)
    (MOVE-DIR pos-2-8 pos-2-9 dir-right)
    (MOVE-DIR pos-2-9 pos-1-9 dir-up)
    (MOVE-DIR pos-2-9 pos-3-9 dir-down)
    (MOVE-DIR pos-2-9 pos-2-8 dir-left)
    (MOVE-DIR pos-3-1 pos-2-1 dir-up)
    (MOVE-DIR pos-3-1 pos-4-1 dir-down)
    (MOVE-DIR pos-3-1 pos-3-2 dir-right)
    (MOVE-DIR pos-3-2 pos-2-2 dir-up)
    (MOVE-DIR pos-3-2 pos-4-2 dir-down)
    (MOVE-DIR pos-3-2 pos-3-1 dir-left)
    (MOVE-DIR pos-3-2 pos-3-3 dir-right)
    (MOVE-DIR pos-3-3 pos-2-3 dir-up)
    (MOVE-DIR pos-3-3 pos-4-3 dir-down)
    (MOVE-DIR pos-3-3 pos-3-2 dir-left)
    (MOVE-DIR pos-3-3 pos-3-4 dir-right)
    (MOVE-DIR pos-3-4 pos-2-4 dir-up)
    (MOVE-DIR pos-3-4 pos-4-4 dir-down)
    (MOVE-DIR pos-3-4 pos-3-3 dir-left)
    (MOVE-DIR pos-3-4 pos-3-5 dir-right)
    (MOVE-DIR pos-3-5 pos-2-5 dir-up)
    (MOVE-DIR pos-3-5 pos-4-5 dir-down)
    (MOVE-DIR pos-3-5 pos-3-4 dir-left)
    (MOVE-DIR pos-3-5 pos-3-6 dir-right)
    (MOVE-DIR pos-3-6 pos-2-6 dir-up)
    (MOVE-DIR pos-3-6 pos-4-6 dir-down)
    (MOVE-DIR pos-3-6 pos-3-5 dir-left)
    (MOVE-DIR pos-3-6 pos-3-7 dir-right)
    (MOVE-DIR pos-3-7 pos-2-7 dir-up)
    (MOVE-DIR pos-3-7 pos-4-7 dir-down)
    (MOVE-DIR pos-3-7 pos-3-6 dir-left)
    (MOVE-DIR pos-3-7 pos-3-8 dir-right)
    (MOVE-DIR pos-3-8 pos-2-8 dir-up)
    (MOVE-DIR pos-3-8 pos-4-8 dir-down)
    (MOVE-DIR pos-3-8 pos-3-7 dir-left)
    (MOVE-DIR pos-3-8 pos-3-9 dir-right)
    (MOVE-DIR pos-3-9 pos-2-9 dir-up)
    (MOVE-DIR pos-3-9 pos-4-9 dir-down)
    (MOVE-DIR pos-3-9 pos-3-8 dir-left)
    (MOVE-DIR pos-4-1 pos-3-1 dir-up)
    (MOVE-DIR pos-4-1 pos-5-1 dir-down)
    (MOVE-DIR pos-4-1 pos-4-2 dir-right)
    (MOVE-DIR pos-4-2 pos-3-2 dir-up)
    (MOVE-DIR pos-4-2 pos-5-2 dir-down)
    (MOVE-DIR pos-4-2 pos-4-1 dir-left)
    (MOVE-DIR pos-4-2 pos-4-3 dir-right)
    (MOVE-DIR pos-4-3 pos-3-3 dir-up)
    (MOVE-DIR pos-4-3 pos-5-3 dir-down)
    (MOVE-DIR pos-4-3 pos-4-2 dir-left)
    (MOVE-DIR pos-4-3 pos-4-4 dir-right)
    (MOVE-DIR pos-4-4 pos-3-4 dir-up)
    (MOVE-DIR pos-4-4 pos-5-4 dir-down)
    (MOVE-DIR pos-4-4 pos-4-3 dir-left)
    (MOVE-DIR pos-4-4 pos-4-5 dir-right)
    (MOVE-DIR pos-4-5 pos-3-5 dir-up)
    (MOVE-DIR pos-4-5 pos-5-5 dir-down)
    (MOVE-DIR pos-4-5 pos-4-4 dir-left)
    (MOVE-DIR pos-4-5 pos-4-6 dir-right)
    (MOVE-DIR pos-4-6 pos-3-6 dir-up)
    (MOVE-DIR pos-4-6 pos-5-6 dir-down)
    (MOVE-DIR pos-4-6 pos-4-5 dir-left)
    (MOVE-DIR pos-4-6 pos-4-7 dir-right)
    (MOVE-DIR pos-4-7 pos-3-7 dir-up)
    (MOVE-DIR pos-4-7 pos-5-7 dir-down)
    (MOVE-DIR pos-4-7 pos-4-6 dir-left)
    (MOVE-DIR pos-4-7 pos-4-8 dir-right)
    (MOVE-DIR pos-4-8 pos-3-8 dir-up)
    (MOVE-DIR pos-4-8 pos-5-8 dir-down)
    (MOVE-DIR pos-4-8 pos-4-7 dir-left)
    (MOVE-DIR pos-4-8 pos-4-9 dir-right)
    (MOVE-DIR pos-4-9 pos-3-9 dir-up)
    (MOVE-DIR pos-4-9 pos-5-9 dir-down)
    (MOVE-DIR pos-4-9 pos-4-8 dir-left)
    (MOVE-DIR pos-5-1 pos-4-1 dir-up)
    (MOVE-DIR pos-5-1 pos-6-1 dir-down)
    (MOVE-DIR pos-5-1 pos-5-2 dir-right)
    (MOVE-DIR pos-5-2 pos-4-2 dir-up)
    (MOVE-DIR pos-5-2 pos-6-2 dir-down)
    (MOVE-DIR pos-5-2 pos-5-1 dir-left)
    (MOVE-DIR pos-5-2 pos-5-3 dir-right)
    (MOVE-DIR pos-5-3 pos-4-3 dir-up)
    (MOVE-DIR pos-5-3 pos-6-3 dir-down)
    (MOVE-DIR pos-5-3 pos-5-2 dir-left)
    (MOVE-DIR pos-5-3 pos-5-4 dir-right)
    (MOVE-DIR pos-5-4 pos-4-4 dir-up)
    (MOVE-DIR pos-5-4 pos-6-4 dir-down)
    (MOVE-DIR pos-5-4 pos-5-3 dir-left)
    (MOVE-DIR pos-5-4 pos-5-5 dir-right)
    (MOVE-DIR pos-5-5 pos-4-5 dir-up)
    (MOVE-DIR pos-5-5 pos-6-5 dir-down)
    (MOVE-DIR pos-5-5 pos-5-4 dir-left)
    (MOVE-DIR pos-5-5 pos-5-6 dir-right)
    (MOVE-DIR pos-5-6 pos-4-6 dir-up)
    (MOVE-DIR pos-5-6 pos-6-6 dir-down)
    (MOVE-DIR pos-5-6 pos-5-5 dir-left)
    (MOVE-DIR pos-5-6 pos-5-7 dir-right)
    (MOVE-DIR pos-5-7 pos-4-7 dir-up)
    (MOVE-DIR pos-5-7 pos-6-7 dir-down)
    (MOVE-DIR pos-5-7 pos-5-6 dir-left)
    (MOVE-DIR pos-5-7 pos-5-8 dir-right)
    (MOVE-DIR pos-5-8 pos-4-8 dir-up)
    (MOVE-DIR pos-5-8 pos-6-8 dir-down)
    (MOVE-DIR pos-5-8 pos-5-7 dir-left)
    (MOVE-DIR pos-5-8 pos-5-9 dir-right)
    (MOVE-DIR pos-5-9 pos-4-9 dir-up)
    (MOVE-DIR pos-5-9 pos-6-9 dir-down)
    (MOVE-DIR pos-5-9 pos-5-8 dir-left)
    (MOVE-DIR pos-6-1 pos-5-1 dir-up)
    (MOVE-DIR pos-6-1 pos-7-1 dir-down)
    (MOVE-DIR pos-6-1 pos-6-2 dir-right)
    (MOVE-DIR pos-6-2 pos-5-2 dir-up)
    (MOVE-DIR pos-6-2 pos-7-2 dir-down)
    (MOVE-DIR pos-6-2 pos-6-1 dir-left)
    (MOVE-DIR pos-6-2 pos-6-3 dir-right)
    (MOVE-DIR pos-6-3 pos-5-3 dir-up)
    (MOVE-DIR pos-6-3 pos-7-3 dir-down)
    (MOVE-DIR pos-6-3 pos-6-2 dir-left)
    (MOVE-DIR pos-6-3 pos-6-4 dir-right)
    (MOVE-DIR pos-6-4 pos-5-4 dir-up)
    (MOVE-DIR pos-6-4 pos-7-4 dir-down)
    (MOVE-DIR pos-6-4 pos-6-3 dir-left)
    (MOVE-DIR pos-6-4 pos-6-5 dir-right)
    (MOVE-DIR pos-6-5 pos-5-5 dir-up)
    (MOVE-DIR pos-6-5 pos-7-5 dir-down)
    (MOVE-DIR pos-6-5 pos-6-4 dir-left)
    (MOVE-DIR pos-6-5 pos-6-6 dir-right)
    (MOVE-DIR pos-6-6 pos-5-6 dir-up)
    (MOVE-DIR pos-6-6 pos-7-6 dir-down)
    (MOVE-DIR pos-6-6 pos-6-5 dir-left)
    (MOVE-DIR pos-6-6 pos-6-7 dir-right)
    (MOVE-DIR pos-6-7 pos-5-7 dir-up)
    (MOVE-DIR pos-6-7 pos-7-7 dir-down)
    (MOVE-DIR pos-6-7 pos-6-6 dir-left)
    (MOVE-DIR pos-6-7 pos-6-8 dir-right)
    (MOVE-DIR pos-6-8 pos-5-8 dir-up)
    (MOVE-DIR pos-6-8 pos-7-8 dir-down)
    (MOVE-DIR pos-6-8 pos-6-7 dir-left)
    (MOVE-DIR pos-6-8 pos-6-9 dir-right)
    (MOVE-DIR pos-6-9 pos-5-9 dir-up)
    (MOVE-DIR pos-6-9 pos-7-9 dir-down)
    (MOVE-DIR pos-6-9 pos-6-8 dir-left)
    (MOVE-DIR pos-7-1 pos-6-1 dir-up)
    (MOVE-DIR pos-7-1 pos-8-1 dir-down)
    (MOVE-DIR pos-7-1 pos-7-2 dir-right)
    (MOVE-DIR pos-7-2 pos-6-2 dir-up)
    (MOVE-DIR pos-7-2 pos-8-2 dir-down)
    (MOVE-DIR pos-7-2 pos-7-1 dir-left)
    (MOVE-DIR pos-7-2 pos-7-3 dir-right)
    (MOVE-DIR pos-7-3 pos-6-3 dir-up)
    (MOVE-DIR pos-7-3 pos-8-3 dir-down)
    (MOVE-DIR pos-7-3 pos-7-2 dir-left)
    (MOVE-DIR pos-7-3 pos-7-4 dir-right)
    (MOVE-DIR pos-7-4 pos-6-4 dir-up)
    (MOVE-DIR pos-7-4 pos-8-4 dir-down)
    (MOVE-DIR pos-7-4 pos-7-3 dir-left)
    (MOVE-DIR pos-7-4 pos-7-5 dir-right)
    (MOVE-DIR pos-7-5 pos-6-5 dir-up)
    (MOVE-DIR pos-7-5 pos-8-5 dir-down)
    (MOVE-DIR pos-7-5 pos-7-4 dir-left)
    (MOVE-DIR pos-7-5 pos-7-6 dir-right)
    (MOVE-DIR pos-7-6 pos-6-6 dir-up)
    (MOVE-DIR pos-7-6 pos-8-6 dir-down)
    (MOVE-DIR pos-7-6 pos-7-5 dir-left)
    (MOVE-DIR pos-7-6 pos-7-7 dir-right)
    (MOVE-DIR pos-7-7 pos-6-7 dir-up)
    (MOVE-DIR pos-7-7 pos-8-7 dir-down)
    (MOVE-DIR pos-7-7 pos-7-6 dir-left)
    (MOVE-DIR pos-7-7 pos-7-8 dir-right)
    (MOVE-DIR pos-7-8 pos-6-8 dir-up)
    (MOVE-DIR pos-7-8 pos-8-8 dir-down)
    (MOVE-DIR pos-7-8 pos-7-7 dir-left)
    (MOVE-DIR pos-7-8 pos-7-9 dir-right)
    (MOVE-DIR pos-7-9 pos-6-9 dir-up)
    (MOVE-DIR pos-7-9 pos-8-9 dir-down)
    (MOVE-DIR pos-7-9 pos-7-8 dir-left)
    (MOVE-DIR pos-8-1 pos-7-1 dir-up)
    (MOVE-DIR pos-8-1 pos-9-1 dir-down)
    (MOVE-DIR pos-8-1 pos-8-2 dir-right)
    (MOVE-DIR pos-8-2 pos-7-2 dir-up)
    (MOVE-DIR pos-8-2 pos-9-2 dir-down)
    (MOVE-DIR pos-8-2 pos-8-1 dir-left)
    (MOVE-DIR pos-8-2 pos-8-3 dir-right)
    (MOVE-DIR pos-8-3 pos-7-3 dir-up)
    (MOVE-DIR pos-8-3 pos-9-3 dir-down)
    (MOVE-DIR pos-8-3 pos-8-2 dir-left)
    (MOVE-DIR pos-8-3 pos-8-4 dir-right)
    (MOVE-DIR pos-8-4 pos-7-4 dir-up)
    (MOVE-DIR pos-8-4 pos-9-4 dir-down)
    (MOVE-DIR pos-8-4 pos-8-3 dir-left)
    (MOVE-DIR pos-8-4 pos-8-5 dir-right)
    (MOVE-DIR pos-8-5 pos-7-5 dir-up)
    (MOVE-DIR pos-8-5 pos-9-5 dir-down)
    (MOVE-DIR pos-8-5 pos-8-4 dir-left)
    (MOVE-DIR pos-8-5 pos-8-6 dir-right)
    (MOVE-DIR pos-8-6 pos-7-6 dir-up)
    (MOVE-DIR pos-8-6 pos-9-6 dir-down)
    (MOVE-DIR pos-8-6 pos-8-5 dir-left)
    (MOVE-DIR pos-8-6 pos-8-7 dir-right)
    (MOVE-DIR pos-8-7 pos-7-7 dir-up)
    (MOVE-DIR pos-8-7 pos-9-7 dir-down)
    (MOVE-DIR pos-8-7 pos-8-6 dir-left)
    (MOVE-DIR pos-8-7 pos-8-8 dir-right)
    (MOVE-DIR pos-8-8 pos-7-8 dir-up)
    (MOVE-DIR pos-8-8 pos-9-8 dir-down)
    (MOVE-DIR pos-8-8 pos-8-7 dir-left)
    (MOVE-DIR pos-8-8 pos-8-9 dir-right)
    (MOVE-DIR pos-8-9 pos-7-9 dir-up)
    (MOVE-DIR pos-8-9 pos-9-9 dir-down)
    (MOVE-DIR pos-8-9 pos-8-8 dir-left)
    (MOVE-DIR pos-9-1 pos-8-1 dir-up)
    (MOVE-DIR pos-9-1 pos-9-2 dir-right)
    (MOVE-DIR pos-9-2 pos-8-2 dir-up)
    (MOVE-DIR pos-9-2 pos-9-1 dir-left)
    (MOVE-DIR pos-9-2 pos-9-3 dir-right)
    (MOVE-DIR pos-9-3 pos-8-3 dir-up)
    (MOVE-DIR pos-9-3 pos-9-2 dir-left)
    (MOVE-DIR pos-9-3 pos-9-4 dir-right)
    (MOVE-DIR pos-9-4 pos-8-4 dir-up)
    (MOVE-DIR pos-9-4 pos-9-3 dir-left)
    (MOVE-DIR pos-9-4 pos-9-5 dir-right)
    (MOVE-DIR pos-9-5 pos-8-5 dir-up)
    (MOVE-DIR pos-9-5 pos-9-4 dir-left)
    (MOVE-DIR pos-9-5 pos-9-6 dir-right)
    (MOVE-DIR pos-9-6 pos-8-6 dir-up)
    (MOVE-DIR pos-9-6 pos-9-5 dir-left)
    (MOVE-DIR pos-9-6 pos-9-7 dir-right)
    (MOVE-DIR pos-9-7 pos-8-7 dir-up)
    (MOVE-DIR pos-9-7 pos-9-6 dir-left)
    (MOVE-DIR pos-9-7 pos-9-8 dir-right)
    (MOVE-DIR pos-9-8 pos-8-8 dir-up)
    (MOVE-DIR pos-9-8 pos-9-7 dir-left)
    (MOVE-DIR pos-9-8 pos-9-9 dir-right)
    (MOVE-DIR pos-9-9 pos-8-9 dir-up)
    (MOVE-DIR pos-9-9 pos-9-8 dir-left)
    (at player-01 pos-1-2)
    (at stone-01 pos-5-7)
    (at stone-02 pos-6-5)
    (clear pos-2-2)
    (clear pos-2-3)
    (clear pos-2-4)
    (clear pos-2-5)
    (clear pos-2-7)
    (clear pos-2-8)
    (clear pos-3-2)
    (clear pos-3-3)
    (clear pos-3-4)
    (clear pos-3-5)
    (clear pos-3-6)
    (clear pos-3-7)
    (clear pos-3-8)
    (clear pos-4-2)
    (clear pos-4-3)
    (clear pos-4-5)
    (clear pos-4-6)
    (clear pos-4-7)
    (clear pos-4-8)
    (clear pos-5-5)
    (clear pos-5-6)
    (clear pos-6-1)
    (clear pos-6-2)
    (clear pos-6-4)
    (clear pos-6-7)
    (clear pos-6-8)
    (clear pos-7-1)
    (clear pos-7-2)
    (clear pos-7-4)
    (clear pos-7-5)
    (clear pos-7-6)
    (clear pos-7-7)
    (clear pos-7-8)
    (clear pos-8-1)
    (clear pos-8-2)
    (clear pos-8-3)
    (clear pos-8-6)
    (clear pos-8-7)
    (clear pos-8-8)
    (clear pos-8-9)
    (clear pos-9-1)
    (clear pos-9-2)
    (clear pos-9-3)
    (clear pos-9-4)
    (clear pos-9-5)
  )
  (:goal (and
    (at stone-02 pos-8-9)
  ))
)

; plan
1. (move player-01 pos-1-2 pos-2-2 dir-down)
   deleted: (at player-01 pos-1-2) (clear pos-2-2)
   added: (at player-01 pos-2-2) (clear pos-1-2)
   goals met: 0 of 1
2. (move player-01 pos-2-2 pos-3-2 dir-down)
   deleted: (at player-01 pos-2-2) (clear pos-3-2)
   added: (at player-01 pos-3-2) (clear pos-2-2)
   goals met: 0 of 1
3. (move player-01 pos-3-2 pos-3-3 dir-right)
   deleted: (at player-01 pos-3-2) (clear pos-3-3)
   added: (at player-01 pos-3-3) (clear pos-3-2)
   goals met: 0 of 1
4. (move player-01 pos-3-3 pos-3-4 dir-right)
   deleted: (at player-01 pos-3-3) (clear pos-3-4)
   added: (at player-01 pos-3-4) (clear pos-3-3)
   goals met: 0 of 1
5. (move player-01 pos-3-4 pos-3-5 dir-right)
   deleted: (at player-01 pos-3-4) (clear pos-3-5)
   added: (at player-01 pos-3-5) (clear pos-3-4)
   goals met: 0 of 1
6. (move player-01 pos-3-5 pos-4-5 dir-down)
   deleted: (at player-01 pos-3-5) (clear pos-4-5)
   added: (at player-01 pos-4-5) (clear pos-3-5)
   goals met: 0 of 1
7. (move player-01 pos-4-5 pos-5-5 dir-down)
   deleted: (at player-01 pos-4-5) (clear pos-5-5)
   added: (at player-01 pos-5-5) (clear pos-4-5)
   goals met: 0 of 1
8. (push-to-nongoal player-01 stone-02 pos-5-5 pos-6-5 pos-7-5 dir-down)
   deleted: (at player-01 pos-5-5) (at stone-02 pos-6-5) (clear pos-7-5)
   added: (at player-01 pos-6-5) (at stone-02 pos-7-5) (clear pos-5-5)
   goals met: 0 of 1
9. (move player-01 pos-6-5 pos-6-4 dir-left)
   deleted: (at player-01 pos-6-5) (clear pos-6-4)
   added: (at player-01 pos-6-4) (clear pos-6-5)
   goals met: 0 of 1
10. (move player-01 pos-6-4 pos-7-4 dir-down)
   deleted: (at player-01 pos-6-4) (clear pos-7-4)
   added: (at player-01 pos-7-4) (clear pos-6-4)
   goals met: 0 of 1
11. (push-to-nongoal player-01 stone-02 pos-7-4 pos-7-5 pos-7-6 dir-right)
   deleted: (at player-01 pos-7-4) (at stone-02 pos-7-5) (clear pos-7-6)
   added: (at player-01 pos-7-5) (at stone-02 pos-7-6) (clear pos-7-4)
   goals met: 0 of 1
12. (push-to-nongoal player-01 stone-02 pos-7-5 pos-7-6 pos-7-7 dir-right)
   deleted: (at player-01 pos-7-5) (at stone-02 pos-7-6) (clear pos-7-7)
   added: (at player-01 pos-7-6) (at stone-02 pos-7-7) (clear pos-7-5)
   goals met: 0 of 1
13. (push-to-goal player-01 stone-02 pos-7-6 pos-7-7 pos-7-8 dir-right)
   deleted: (at player-01 pos-7-6) (at stone-02 pos-7-7) (clear pos-7-8)
   added: (at player-01 pos-7-7) (at stone-02 pos-7-8) (clear pos-7-6) (at-goal stone-02)
   goals met: 0 of 1
14. (move player-01 pos-7-7 pos-6-7 dir-up)
   deleted: (at player-01 pos-7-7) (clear pos-6-7)
   added: (at player-01 pos-6-7) (clear pos-7-7)
   goals met: 0 of 1
15. (move player-01 pos-6-7 pos-6-8 dir-right)
   deleted: (at player-01 pos-6-7) (clear pos-6-8)
   added: (at player-01 pos-6-8) (clear pos-6-7)
   goals met: 0 of 1
16. (push-to-nongoal player-01 stone-02 pos-6-8 pos-7-8 pos-8-8 dir-down)
   deleted: (at player-01 pos-6-8) (at stone-02 pos-7-8) (clear pos-8-8) (at-goal stone-02)
   added: (at player-01 pos-7-8) (at stone-02 pos-8-8) (clear pos-6-8)
   goals met: 0 of 1
17. (move player-01 pos-7-8 pos-7-7 dir-left)
   deleted: (at player-01 pos-7-8) (clear pos-7-7)
   added: (at player-01 pos-7-7) (clear pos-7-8)
   goals met: 0 of 1
18. (move player-01 pos-7-7 pos-8-7 dir-down)
   deleted: (at player-01 pos-7-7) (clear pos-8-7)
   added: (at player-01 pos-8-7) (clear pos-7-7)
   goals met: 0 of 1
19. (push-to-nongoal player-01 stone-02 pos-8-7 pos-8-8 pos-8-9 dir-right)
   deleted: (at player-01 pos-8-7) (at stone-02 pos-8-8) (clear pos-8-9)
   added: (at player-01 pos-8-8) (at stone-02 pos-8-9) (clear pos-8-7)
   goals met: 1 of 1
